// #1
const num = [1, 4, 8];
console.log(num);
num[1] = 10;
console.log(num);

//#2
const space = ["kizaru", "markenly","alblak52"];
console.log(space);
space[3] = "bigbabytape";
console.log(space);


// #3

const numbs = [1, 52 , 14 , 88];
console.log(numbs[0] + numbs[1] + numbs[2] + numbs[3])

// #4

const number = [1, 2, 3, 4, 5];
for (let i = 0; i < number.length; i++) {
    console.log(number[i]);
  }
console.log(number);


// 5#


// Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10. +
// Створити масив із трьох рядків. Додати до масиву ще одну рядків.+


// Створити скрипт який поверне суму всіх чисел в масиві. -

// Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.-

// Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів.-

// Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.-

// Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.-